Revit 2026 API

# RebarReinforcementDataCreate Method

---

Creates a new instance of RebarReinforcementData, or  if the operation fails.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarReinforcementData Create(
	ElementId rebarId,
	int iEnd
)
```
```vb
Public Shared Function Create (
	rebarId As ElementId,
	iEnd As Integer
) As RebarReinforcementData
```
```cpp
public:
static RebarReinforcementData^ Create(
	ElementId^ rebarId,
	int iEnd
)
```
```fsharp
static member Create :
        rebarId : ElementId *
        iEnd : int -> RebarReinforcementData
```

#### Parameters

rebarId ElementId
     the Id of the rebar
iEnd Int32
     The end of rebar where the coupler stays. This should be 0 or 1

#### Return Value

RebarReinforcementData Creates a new instance of RebarReinforcementData

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace